rising-bubble-2-2/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.02;

vertices
(
   (-10  -10  -10)
   ( 10  -10  -10)
   ( 10   10  -10)
   (-10   10  -10)

   (-10  -10  10)
   ( 10  -10  10)
   ( 10   10  10)
   (-10   10  10)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    front 
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    back 
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    bottom 
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    top 
    {
        type patch;
        faces
        (
            (7 6 2 3)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
